#### Terraform Format 🖌 `success`
#### Terraform Init ⚙️ `success`
#### Terraform Validate 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.dynamodb_billing_enforcer[0].data.archive_file.enforcer_lambda: Reading...
module.dynamodb_billing_enforcer[0].data.archive_file.enforcer_lambda: Read complete after 0s [id=f7687ee4e667562df795fa50d0ebba1a132b3bb7]
module.scp_manager.aws_organizations_policy.restrictions: Refreshing state... [id=p-6tw8eixp]
module.cost_anomaly_detection[0].data.aws_caller_identity.current: Reading...
data.aws_organizations_organizational_unit_descendant_accounts.sandbox_pool[0]: Reading...
module.cost_anomaly_detection[0].data.aws_caller_identity.current: Read complete after 0s [id=955063685555]
module.scp_manager.aws_organizations_policy.cost_avoidance: Refreshing state... [id=p-ozmh7axs]
module.scp_manager.aws_organizations_policy.limit_regions: Refreshing state... [id=p-02s3te0u]
module.scp_manager.aws_organizations_policy.nuke_supported_services: Refreshing state... [id=p-7pd0szg9]
data.aws_organizations_organizational_unit_descendant_accounts.sandbox_pool[0]: Read complete after 0s [id=ou-2laj-sre4rnjs]
module.budgets.aws_budgets_budget.daily_cost[0]: Refreshing state... [id=955063685555:NDX Try usage daily]
module.budgets.aws_budgets_budget.monthly_cost[0]: Refreshing state... [id=955063685555:NDX Try budget]
module.scp_manager.aws_organizations_policy_attachment.limit_regions: Refreshing state... [id=ou-2laj-4dyae1oa:p-02s3te0u]
module.scp_manager.aws_organizations_policy_attachment.cost_avoidance: Refreshing state... [id=ou-2laj-sre4rnjs:p-ozmh7axs]
module.scp_manager.aws_organizations_policy_attachment.nuke_supported_services: Refreshing state... [id=ou-2laj-4dyae1oa:p-7pd0szg9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.budgets.aws_budgets_budget.daily_cost[0] will be destroyed
  # (because module.budgets is not in configuration)
  # (moved from module.budgets.aws_budgets_budget.daily_cost)
  - resource "aws_budgets_budget" "daily_cost" {
      - account_id        = "955063685555" -> null
      - arn               = "arn:aws:budgets::955063685555:budget/NDX Try usage daily" -> null
      - billing_view_arn  = "arn:aws:billing::955063685555:billingview/primary" -> null
      - budget_type       = "COST" -> null
      - id                = "955063685555:NDX Try usage daily" -> null
      - limit_amount      = "50.0" -> null
      - limit_unit        = "USD" -> null
      - name              = "NDX Try usage daily" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
      - time_period_end   = "2087-06-15_00:00" -> null
      - time_period_start = "2025-12-08_00:00" -> null
      - time_unit         = "DAILY" -> null

      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-aaaaqa6ovbj5owumuw4jkzc44m@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [] -> null
          - threshold                  = 100 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-aaaaqa6ovbj5owumuw4jkzc44m@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [] -> null
          - threshold                  = 10 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-aaaaqa6ovbj5owumuw4jkzc44m@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [] -> null
          - threshold                  = 50 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
    }

  # module.budgets.aws_budgets_budget.monthly_cost[0] will be destroyed
  # (because module.budgets is not in configuration)
  - resource "aws_budgets_budget" "monthly_cost" {
      - account_id        = "955063685555" -> null
      - arn               = "arn:aws:budgets::955063685555:budget/NDX Try budget" -> null
      - billing_view_arn  = "arn:aws:billing::955063685555:billingview/primary" -> null
      - budget_type       = "COST" -> null
      - id                = "955063685555:NDX Try budget" -> null
      - limit_amount      = "1000.0" -> null
      - limit_unit        = "USD" -> null
      - name              = "NDX Try budget" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
      - time_period_end   = "2087-06-15_00:00" -> null
      - time_period_start = "2025-12-01_00:00" -> null
      - time_unit         = "MONTHLY" -> null

      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-aaaaqa6ovbj5owumuw4jkzc44m@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [] -> null
          - threshold                  = 100 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-aaaaqa6ovbj5owumuw4jkzc44m@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [] -> null
          - threshold                  = 85 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "FORECASTED" -> null
          - subscriber_email_addresses = [
              - "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              - "ndx-aaaaqa6ovbj5owumuw4jkzc44m@gds.slack.com",
              - "ndx@dsit.gov.uk",
            ] -> null
          - subscriber_sns_topic_arns  = [] -> null
          - threshold                  = 100 -> null
          - threshold_type             = "PERCENTAGE" -> null
        }
    }

  # module.budgets[0].aws_budgets_budget.daily_cost_per_account["221792773038"] will be created
  + resource "aws_budgets_budget" "daily_cost_per_account" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "50"
      + limit_unit        = "USD"
      + name              = "ndx-sandbox-daily-221792773038"
      + name_prefix       = (known after apply)
      + tags              = {
          + "Component"        = "Budget-Guardrails"
          + "SandboxAccountId" = "221792773038"
        }
      + tags_all          = {
          + "Component"        = "Budget-Guardrails"
          + "Environment"      = "production"
          + "ManagedBy"        = "Terraform"
          + "Project"          = "NDX"
          + "Repository"       = "terraform-scp-overrides"
          + "SandboxAccountId" = "221792773038"
        }
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "DAILY"

      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "221792773038",
            ]
        }

      + cost_types {
          + include_credit             = false
          + include_discount           = true
          + include_other_subscription = true
          + include_recurring          = true
          + include_refund             = false
          + include_subscription       = true
          + include_support            = true
          + include_tax                = true
          + include_upfront            = true
          + use_amortized              = false
          + use_blended                = false
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 10
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 50
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.budgets[0].aws_budgets_budget.monthly_cost_per_account["221792773038"] will be created
  + resource "aws_budgets_budget" "monthly_cost_per_account" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "1000"
      + limit_unit        = "USD"
      + name              = "ndx-sandbox-monthly-221792773038"
      + name_prefix       = (known after apply)
      + tags              = {
          + "Component"        = "Budget-Guardrails"
          + "SandboxAccountId" = "221792773038"
        }
      + tags_all          = {
          + "Component"        = "Budget-Guardrails"
          + "Environment"      = "production"
          + "ManagedBy"        = "Terraform"
          + "Project"          = "NDX"
          + "Repository"       = "terraform-scp-overrides"
          + "SandboxAccountId" = "221792773038"
        }
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "MONTHLY"

      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "221792773038",
            ]
        }

      + cost_types {
          + include_credit             = false
          + include_discount           = true
          + include_other_subscription = true
          + include_recurring          = true
          + include_refund             = false
          + include_subscription       = true
          + include_support            = true
          + include_tax                = true
          + include_upfront            = true
          + use_amortized              = false
          + use_blended                = false
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 85
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "FORECASTED"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.budgets[0].aws_budgets_budget.service["apigateway"] will be created
  + resource "aws_budgets_budget" "service" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "5"
      + limit_unit        = "USD"
      + name              = "ndx-sandbox-apigateway-daily"
      + name_prefix       = (known after apply)
      + tags              = {
          + "Component" = "Budget-Guardrails"
        }
      + tags_all          = {
          + "Component"   = "Budget-Guardrails"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "DAILY"

      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "221792773038",
            ]
        }
      + cost_filter {
          + name   = "Service"
          + values = [
              + "Amazon API Gateway",
            ]
        }

      + cost_types {
          + include_credit             = false
          + include_discount           = true
          + include_other_subscription = true
          + include_recurring          = true
          + include_refund             = false
          + include_subscription       = true
          + include_support            = true
          + include_tax                = true
          + include_upfront            = true
          + use_amortized              = false
          + use_blended                = false
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 80
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.budgets[0].aws_budgets_budget.service["bedrock"] will be created
  + resource "aws_budgets_budget" "service" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "50"
      + limit_unit        = "USD"
      + name              = "ndx-sandbox-bedrock-daily"
      + name_prefix       = (known after apply)
      + tags              = {
          + "Component" = "Budget-Guardrails"
        }
      + tags_all          = {
          + "Component"   = "Budget-Guardrails"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "DAILY"

      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "221792773038",
            ]
        }
      + cost_filter {
          + name   = "Service"
          + values = [
              + "Amazon Bedrock",
            ]
        }

      + cost_types {
          + include_credit             = false
          + include_discount           = true
          + include_other_subscription = true
          + include_recurring          = true
          + include_refund             = false
          + include_subscription       = true
          + include_support            = true
          + include_tax                = true
          + include_upfront            = true
          + use_amortized              = false
          + use_blended                = false
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 50
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 80
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.budgets[0].aws_budgets_budget.service["cloudwatch"] will be created
  + resource "aws_budgets_budget" "service" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "5"
      + limit_unit        = "USD"
      + name              = "ndx-sandbox-cloudwatch-daily"
      + name_prefix       = (known after apply)
      + tags              = {
          + "Component" = "Budget-Guardrails"
        }
      + tags_all          = {
          + "Component"   = "Budget-Guardrails"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "DAILY"

      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "221792773038",
            ]
        }
      + cost_filter {
          + name   = "Service"
          + values = [
              + "AmazonCloudWatch",
            ]
        }

      + cost_types {
          + include_credit             = false
          + include_discount           = true
          + include_other_subscription = true
          + include_recurring          = true
          + include_refund             = false
          + include_subscription       = true
          + include_support            = true
          + include_tax                = true
          + include_upfront            = true
          + use_amortized              = false
          + use_blended                = false
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 50
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 80
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.budgets[0].aws_budgets_budget.service["data_transfer"] will be created
  + resource "aws_budgets_budget" "service" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "20"
      + limit_unit        = "USD"
      + name              = "ndx-sandbox-data-transfer-daily"
      + name_prefix       = (known after apply)
      + tags              = {
          + "Component" = "Budget-Guardrails"
        }
      + tags_all          = {
          + "Component"   = "Budget-Guardrails"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "DAILY"

      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "221792773038",
            ]
        }
      + cost_filter {
          + name   = "UsageType"
          + values = [
              + "DataTransfer-Out-Bytes",
              + "DataTransfer-Regional-Bytes",
            ]
        }

      + cost_types {
          + include_credit             = false
          + include_discount           = true
          + include_other_subscription = true
          + include_recurring          = true
          + include_refund             = false
          + include_subscription       = true
          + include_support            = true
          + include_tax                = true
          + include_upfront            = true
          + use_amortized              = false
          + use_blended                = false
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 80
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.budgets[0].aws_budgets_budget.service["dynamodb"] will be created
  + resource "aws_budgets_budget" "service" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "50"
      + limit_unit        = "USD"
      + name              = "ndx-sandbox-dynamodb-daily"
      + name_prefix       = (known after apply)
      + tags              = {
          + "Component" = "Budget-Guardrails"
        }
      + tags_all          = {
          + "Component"   = "Budget-Guardrails"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "DAILY"

      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "221792773038",
            ]
        }
      + cost_filter {
          + name   = "Service"
          + values = [
              + "Amazon DynamoDB",
            ]
        }

      + cost_types {
          + include_credit             = false
          + include_discount           = true
          + include_other_subscription = true
          + include_recurring          = true
          + include_refund             = false
          + include_subscription       = true
          + include_support            = true
          + include_tax                = true
          + include_upfront            = true
          + use_amortized              = false
          + use_blended                = false
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 80
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.budgets[0].aws_budgets_budget.service["ec2"] will be created
  + resource "aws_budgets_budget" "service" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "100"
      + limit_unit        = "USD"
      + name              = "ndx-sandbox-ec2-daily"
      + name_prefix       = (known after apply)
      + tags              = {
          + "Component" = "Budget-Guardrails"
        }
      + tags_all          = {
          + "Component"   = "Budget-Guardrails"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "DAILY"

      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "221792773038",
            ]
        }
      + cost_filter {
          + name   = "Service"
          + values = [
              + "Amazon Elastic Compute Cloud - Compute",
            ]
        }

      + cost_types {
          + include_credit             = false
          + include_discount           = true
          + include_other_subscription = true
          + include_recurring          = true
          + include_refund             = false
          + include_subscription       = true
          + include_support            = true
          + include_tax                = true
          + include_upfront            = true
          + use_amortized              = false
          + use_blended                = false
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 80
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.budgets[0].aws_budgets_budget.service["lambda"] will be created
  + resource "aws_budgets_budget" "service" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "50"
      + limit_unit        = "USD"
      + name              = "ndx-sandbox-lambda-daily"
      + name_prefix       = (known after apply)
      + tags              = {
          + "Component" = "Budget-Guardrails"
        }
      + tags_all          = {
          + "Component"   = "Budget-Guardrails"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "DAILY"

      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "221792773038",
            ]
        }
      + cost_filter {
          + name   = "Service"
          + values = [
              + "AWS Lambda",
            ]
        }

      + cost_types {
          + include_credit             = false
          + include_discount           = true
          + include_other_subscription = true
          + include_recurring          = true
          + include_refund             = false
          + include_subscription       = true
          + include_support            = true
          + include_tax                = true
          + include_upfront            = true
          + use_amortized              = false
          + use_blended                = false
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 80
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.budgets[0].aws_budgets_budget.service["rds"] will be created
  + resource "aws_budgets_budget" "service" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "30"
      + limit_unit        = "USD"
      + name              = "ndx-sandbox-rds-daily"
      + name_prefix       = (known after apply)
      + tags              = {
          + "Component" = "Budget-Guardrails"
        }
      + tags_all          = {
          + "Component"   = "Budget-Guardrails"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "DAILY"

      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "221792773038",
            ]
        }
      + cost_filter {
          + name   = "Service"
          + values = [
              + "Amazon Relational Database Service",
            ]
        }

      + cost_types {
          + include_credit             = false
          + include_discount           = true
          + include_other_subscription = true
          + include_recurring          = true
          + include_refund             = false
          + include_subscription       = true
          + include_support            = true
          + include_tax                = true
          + include_upfront            = true
          + use_amortized              = false
          + use_blended                = false
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 80
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.budgets[0].aws_budgets_budget.service["s3"] will be created
  + resource "aws_budgets_budget" "service" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "10"
      + limit_unit        = "USD"
      + name              = "ndx-sandbox-s3-daily"
      + name_prefix       = (known after apply)
      + tags              = {
          + "Component" = "Budget-Guardrails"
        }
      + tags_all          = {
          + "Component"   = "Budget-Guardrails"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "DAILY"

      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "221792773038",
            ]
        }
      + cost_filter {
          + name   = "Service"
          + values = [
              + "Amazon Simple Storage Service",
            ]
        }

      + cost_types {
          + include_credit             = false
          + include_discount           = true
          + include_other_subscription = true
          + include_recurring          = true
          + include_refund             = false
          + include_subscription       = true
          + include_support            = true
          + include_tax                = true
          + include_upfront            = true
          + use_amortized              = false
          + use_blended                = false
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 80
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.budgets[0].aws_budgets_budget.service["stepfunctions"] will be created
  + resource "aws_budgets_budget" "service" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "5"
      + limit_unit        = "USD"
      + name              = "ndx-sandbox-stepfunctions-daily"
      + name_prefix       = (known after apply)
      + tags              = {
          + "Component" = "Budget-Guardrails"
        }
      + tags_all          = {
          + "Component"   = "Budget-Guardrails"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "DAILY"

      + cost_filter {
          + name   = "LinkedAccount"
          + values = [
              + "221792773038",
            ]
        }
      + cost_filter {
          + name   = "Service"
          + values = [
              + "AWS Step Functions",
            ]
        }

      + cost_types {
          + include_credit             = false
          + include_discount           = true
          + include_other_subscription = true
          + include_recurring          = true
          + include_refund             = false
          + include_subscription       = true
          + include_support            = true
          + include_tax                = true
          + include_upfront            = true
          + use_amortized              = false
          + use_blended                = false
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 100
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk",
              + "ndx-xxxxx@gds.slack.com",
              + "ndx@dsit.gov.uk",
            ]
          + subscriber_sns_topic_arns  = (known after apply)
          + threshold                  = 80
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.budgets[0].aws_iam_role.budget_actions[0] will be created
  + resource "aws_iam_role" "budget_actions" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "budgets.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ndx-sandbox-budget-actions"
      + name_prefix           = (known after apply)
      + path                  = "/service-role/"
      + tags                  = {
          + "Component" = "Budget-Guardrails"
          + "Purpose"   = "Budget-Automated-Actions"
        }
      + tags_all              = {
          + "Component"   = "Budget-Guardrails"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Purpose"     = "Budget-Automated-Actions"
          + "Repository"  = "terraform-scp-overrides"
        }
      + unique_id             = (known after apply)
    }

  # module.budgets[0].aws_iam_role_policy.budget_actions[0] will be created
  + resource "aws_iam_role_policy" "budget_actions" {
      + id          = (known after apply)
      + name        = "ndx-sandbox-budget-actions-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ec2:StopInstances",
                          + "ec2:DescribeInstances",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:ResourceTag/ManagedBy" = "InnovationSandbox"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "AllowEC2Stop"
                    },
                  + {
                      + Action   = [
                          + "rds:StopDBInstance",
                          + "rds:StopDBCluster",
                          + "rds:DescribeDBInstances",
                          + "rds:DescribeDBClusters",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowRDSStop"
                    },
                  + {
                      + Action    = [
                          + "iam:AttachUserPolicy",
                          + "iam:AttachRolePolicy",
                        ]
                      + Condition = {
                          + ArnEquals = {
                              + "iam:PolicyArn" = "arn:aws:iam::aws:policy/AWSDenyAll"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "AllowIAMPolicyAttachment"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.budgets[0].aws_sns_topic.budget_alerts[0] will be created
  + resource "aws_sns_topic" "budget_alerts" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + display_name                = "Innovation Sandbox Budget Alerts"
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "ndx-sandbox-budget-alerts"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + signature_version           = (known after apply)
      + tags                        = {
          + "Component" = "Budget-Guardrails"
          + "Purpose"   = "Budget-Alerts"
        }
      + tags_all                    = {
          + "Component"   = "Budget-Guardrails"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Purpose"     = "Budget-Alerts"
          + "Repository"  = "terraform-scp-overrides"
        }
      + tracing_config              = (known after apply)
    }

  # module.budgets[0].aws_sns_topic_policy.budget_alerts[0] will be created
  + resource "aws_sns_topic_policy" "budget_alerts" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
      + region = "us-east-1"
    }

  # module.cost_anomaly_detection[0].aws_ce_anomaly_monitor.linked_accounts[0] will be created
  + resource "aws_ce_anomaly_monitor" "linked_accounts" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + monitor_dimension = "LINKED_ACCOUNT"
      + monitor_type      = "DIMENSIONAL"
      + name              = "ndx-linked-account-anomaly-monitor"
      + tags              = {
          + "Component" = "Cost-Anomaly-Detection"
          + "Name"      = "ndx-linked-account-anomaly-monitor"
        }
      + tags_all          = {
          + "Component"   = "Cost-Anomaly-Detection"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ndx-linked-account-anomaly-monitor"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
    }

  # module.cost_anomaly_detection[0].aws_ce_anomaly_monitor.main will be created
  + resource "aws_ce_anomaly_monitor" "main" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + monitor_dimension = "SERVICE"
      + monitor_type      = "DIMENSIONAL"
      + name              = "ndx-cost-anomaly-monitor"
      + tags              = {
          + "Component" = "Cost-Anomaly-Detection"
          + "Name"      = "ndx-cost-anomaly-monitor"
        }
      + tags_all          = {
          + "Component"   = "Cost-Anomaly-Detection"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ndx-cost-anomaly-monitor"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
    }

  # module.cost_anomaly_detection[0].aws_ce_anomaly_subscription.high_priority[0] will be created
  + resource "aws_ce_anomaly_subscription" "high_priority" {
      + account_id       = (known after apply)
      + arn              = (known after apply)
      + frequency        = "IMMEDIATE"
      + id               = (known after apply)
      + monitor_arn_list = (known after apply)
      + name             = "ndx-high-priority-anomaly-subscription"
      + tags             = {
          + "Component" = "Cost-Anomaly-Detection"
          + "Name"      = "ndx-high-priority-anomaly-subscription"
        }
      + tags_all         = {
          + "Component"   = "Cost-Anomaly-Detection"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ndx-high-priority-anomaly-subscription"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }

      + subscriber {
          + address = (known after apply)
          + type    = "SNS"
        }

      + threshold_expression {
          + dimension {
              + key           = "ANOMALY_TOTAL_IMPACT_ABSOLUTE"
              + match_options = [
                  + "GREATER_THAN_OR_EQUAL",
                ]
              + values        = [
                  + "50",
                ]
            }
        }
    }

  # module.cost_anomaly_detection[0].aws_ce_anomaly_subscription.main will be created
  + resource "aws_ce_anomaly_subscription" "main" {
      + account_id       = (known after apply)
      + arn              = (known after apply)
      + frequency        = "DAILY"
      + id               = (known after apply)
      + monitor_arn_list = (known after apply)
      + name             = "ndx-cost-anomaly-subscription"
      + tags             = {
          + "Component" = "Cost-Anomaly-Detection"
          + "Name"      = "ndx-cost-anomaly-subscription"
        }
      + tags_all         = {
          + "Component"   = "Cost-Anomaly-Detection"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ndx-cost-anomaly-subscription"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }

      + subscriber {
          + address = (known after apply)
          + type    = "SNS"
        }

      + threshold_expression {
          + dimension {
              + key           = "ANOMALY_TOTAL_IMPACT_ABSOLUTE"
              + match_options = [
                  + "GREATER_THAN_OR_EQUAL",
                ]
              + values        = [
                  + "10",
                ]
            }
        }
    }

  # module.cost_anomaly_detection[0].aws_sns_topic.cost_anomaly_alerts[0] will be created
  + resource "aws_sns_topic" "cost_anomaly_alerts" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + display_name                = "NDX Cost Anomaly Alerts"
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "ndx-cost-anomaly-alerts"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + signature_version           = (known after apply)
      + tags                        = {
          + "Component" = "Cost-Anomaly-Detection"
          + "Name"      = "ndx-cost-anomaly-alerts"
        }
      + tags_all                    = {
          + "Component"   = "Cost-Anomaly-Detection"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ndx-cost-anomaly-alerts"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
      + tracing_config              = (known after apply)
    }

  # module.cost_anomaly_detection[0].aws_sns_topic_policy.cost_anomaly_alerts[0] will be created
  + resource "aws_sns_topic_policy" "cost_anomaly_alerts" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
      + region = "us-east-1"
    }

  # module.cost_anomaly_detection[0].aws_sns_topic_subscription.email[0] will be created
  + resource "aws_sns_topic_subscription" "email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "chris.Nesbitt-Smith@digital.cabinet-office.gov.uk"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + region                          = "us-east-1"
      + topic_arn                       = (known after apply)
    }

  # module.cost_anomaly_detection[0].aws_sns_topic_subscription.email[1] will be created
  + resource "aws_sns_topic_subscription" "email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "ndx@dsit.gov.uk"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + region                          = "us-east-1"
      + topic_arn                       = (known after apply)
    }

  # module.cost_anomaly_detection[0].aws_sns_topic_subscription.email[2] will be created
  + resource "aws_sns_topic_subscription" "email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "ndx-xxxxx@gds.slack.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + region                          = "us-east-1"
      + topic_arn                       = (known after apply)
    }

  # module.dynamodb_billing_enforcer[0].aws_cloudwatch_event_rule.dynamodb_table_changes will be created
  + resource "aws_cloudwatch_event_rule" "dynamodb_table_changes" {
      + arn            = (known after apply)
      + description    = "Detects DynamoDB CreateTable and UpdateTable events for billing mode enforcement"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + eventName   = [
                      + "CreateTable",
                      + "UpdateTable",
                    ]
                  + eventSource = [
                      + "dynamodb.amazonaws.com",
                    ]
                }
              + detail-type = [
                  + "AWS API Call via CloudTrail",
                ]
              + source      = [
                  + "aws.dynamodb",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "ndx-dynamodb-billing-enforcer"
      + name_prefix    = (known after apply)
      + region         = "us-east-1"
      + tags           = {
          + "Component" = "DynamoDB-Billing-Enforcer"
        }
      + tags_all       = {
          + "Component"   = "DynamoDB-Billing-Enforcer"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
    }

  # module.dynamodb_billing_enforcer[0].aws_cloudwatch_event_target.invoke_enforcer_lambda will be created
  + resource "aws_cloudwatch_event_target" "invoke_enforcer_lambda" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "us-east-1"
      + rule           = "ndx-dynamodb-billing-enforcer"
      + target_id      = "InvokeEnforcerLambda"
    }

  # module.dynamodb_billing_enforcer[0].aws_cloudwatch_log_group.enforcer_lambda will be created
  + resource "aws_cloudwatch_log_group" "enforcer_lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/ndx-dynamodb-billing-enforcer"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + retention_in_days           = 7
      + skip_destroy                = false
      + tags                        = {
          + "Component" = "DynamoDB-Billing-Enforcer"
        }
      + tags_all                    = {
          + "Component"   = "DynamoDB-Billing-Enforcer"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
    }

  # module.dynamodb_billing_enforcer[0].aws_iam_role.enforcer_lambda will be created
  + resource "aws_iam_role" "enforcer_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {


... (truncated, see workflow logs for full output)
```

</details>

*Pushed by: @gjarzebak95, Action: `pull_request`*